{
  "quotes": [
    "Reason has always existed, but not always in a reasonable form. --karl marx",
    "Communism is the riddle of history solved, and it knows itself to be this solution. --karl marx",
    "The philosophers have only interpreted the world, in various ways; the point is to change it. --karl marx",
    "From each according to his abilities, to each according to his needs. --karl marx",
    "Democracy is the road to socialism. --karl marx",
    "Necessity is blind until it becomes conscious. Freedom is the consciousness of necessity. --karl marx",
    "The first requisite for the happiness of the people is the abolition of religion. --karl marx",
    "In capitalst society capital is independent and has individuality, while the living person is dependent and has no individuality. --karl marx",
    "Let the ruling classes tremble at a communist revolution.",
    "The proletarians have nothing to lose but their chains. They have a world to win. Workingmen of all countries, unite! --karl marx",
    "The rich will do anything for the poor but get off their backs. --karl marx",
    "Social progress can be measured by the social position of the female sex. --karl marx",
    "The meaning of peace is the absence of opposition to socialism. --karl marx",
    "Revolutions are the locomotives of history. --karl marx",
    "There is a specter haunting Europe, the specter of Communism. --karl marx",
    "The ruling ideas of each age have ever been the ideas of its ruling class. --karl marx",
    "Everything must justify its existence before the judgment seat of Reason, or give up existence. --engels",
    "Fascism is capitalism in decay. --lenin",
    "Capitalism has triumphed all over the world, but this triumph is only the prelude to the triumph of labour over capital. --lenin",
    "When feudalism was overthrown and “free” capitalist society appeared in the world, it at once became apparent that this freedom meant a new system of oppression and exploitation of the working people. --lenin",
    "People always have been the foolish victims of deception and self-deception in politics, and they always will be until they have learnt to seek out the interests of some class or other behind all moral, religious, political and social phrases, declarations and promises. --lenin",
    "War cannot be abolished unless classes are abolished and Socialism is created. --lenin",
    "Democracy for an insignificant minority, democracy for the rich — that is the democracy of capitalist society. --lenin",
    "The economic anarchy of capitalist society as it exists today is, in my opinion, the real source of the evil. --Albert Einstein",
    "I am convinced there is only one way to eliminate these grave evils, namely through the establishment of a socialist economy, accompanied by an educational system which would be oriented toward social goals. --Albert Einstein",
    "Not believing in force is the same as not believing in gravity. --trotsky",
    "The end may justify the means as long as there is something that justifies the end. --trotsky",
    "From the first day to this, sheer greed was the driving spirit of civilization. --engels",
    "All history has been a history of class struggles between dominated classes at various stages of social development. --engels",
    "Freedom does not consist in any dreamt-of independence from natural laws, but in the knowledge of these laws, and in the possibility this gives of systematically making them work towards definite ends. --engels",
    "The country that is more developed industrially only shows, to the less developed, the image of its own future. --karl marx",
    "Everyone who knows anything of history also knows that great social revolutions are impossible without the feminine ferment. Social progress may be measured precisely by the social position of the fair sex --karl marx",
    "The bourgeoisie is just as necessary a precondition for the socialist revolution as is the proletariat itself. --karl marx",
    "Sell a man a fish, he eats for a day, teach a man how to fish, you ruin a wonderful business opportunity. --karl marx",
    "History repeats itself, first as tragedy, second as farce. --karl marx",
    "The last capitalist we hang shall be the one who sold us the rope. --karl marx",
    "The abolition of religion as the illusory happiness of the people is the demand for their real happiness. --karl marx",
    "To be radical is to grasp things by the root. --karl marx",
    "It is not the consciousness of men that determines their being, but, on the contrary, their social being that determines their consciousness. --karl marx",
    "The history of all hitherto existing society is the history of class struggles. --karl marx",    
    "Religion is the impotence of the human mind to deal with occurrences it cannot understand. --karl marx",
    "There are decades where nothing happens; and there are weeks where decades happen. --lenin",
    "Can a nation be free if it oppresses other nations? It cannot. --lenin",
    "While the State exists, there can be no freedom. When there is freedom there will be no State. --lenin",
    "Every society is three meals away from chaos --lenin",
    "The question whether objective truth can be attributed to human thinking is not a question of theory but is a practical question. --karl marx",
    "The hand-mill gives you society with the feudal lord; the steam-mill society with the industrial capitalist. --karl marx",
    "The slave frees himself when, of all the relations of private property, he abolishes only the relation of slavery and thereby becomes a proletarian; the proletarian can free himself only by abolishing private property in general. --engels",
    "History is the judge — its executioner, the proletarian. --karl marx",
    "All economists share the error of examining surplus-value not as such, in its pure form, but in the particular forms of profit and rent. --karl marx",  
    "Labour is ... not the only source of material wealth, ie of the use-values it produces. As William Petty says, labour is the father of material wealth, the earth is its mother. --karl marx",
    "Not only can we manage very well without the interference of the capitalist class in the great industries of the country, but that their interference is becoming more and more a nuisance. --engels",
    "That today, when the wave has ebbed, there remain and will remain only real Marxists, does not frighten us but rejoices us. --lenin",
    "All official and liberal science defends wage-slavery, whereas Marxism has declared relentless war on that slavery. --lenin",
    "Capital, created by the labour of the worker, crushes the worker, ruining small proprietors and creating an army of unemployed. --lenin",
    "Socialists cannot achieve their great aim without fighting against all oppression of nations. --lenin",
    "It is, of course, much easier to shout, abuse, and howl than to attempt to relate, to explain. --lenin",
    "Without an alliance with non-Communists in the most diverse spheres of activity there can be no question of any successful communist construction. --lenin",
    "The most important thing is to know how to awaken in the still undeveloped masses an intelligent attitude towards religious questions and an intelligent criticism of religions. --lenin",
    "Capital is an international force. To vanquish it, an international workers' alliance, an international workers' brotherhood, is needed. --lenin",
    "We are opposed to national enmity and discord, to national exclusiveness. We are internationalists. --lenin",
    "If the leaders seek only to preserve themselves, that is what they become; preserves, dried preserves. --trotsky",
    "We must give a scientific explanation of society, and clearly explain it to the masses. That is the difference between Marxism and reformism. --trotsky",
    "Nobody, thank god, believes in miracles nowadays. Miraculous prophecy is a fairy-tale. But scientific prophecy is a fact. --lenin",
    "The executive of the modern state is but a committee for managing the common affairs of the whole bourgeoisie. --karl marx",
    "Communism deprives no man of the ability to appropriate the fruits of his labour. The only thing it deprives him of is the ability to enslave others by means of such appropriations. --karl marx",
    "The more powerful the class, the more it claims not to exist. --Guy Debord",
    "Never work. --Guy Debord",
    "Boredom is always counter-revolutionary. Always. --Guy Debord",
    "A nationalised planned economy needs democracy, as the human body needs oxygen. --trotsky",
    "Politics is concentrated economics --lenin",
    "Socialism is humanity's leap from the realm of necessity into the realm of freedom. --engels",
    "All past history was the history of class struggles; that these warring classes of society are always the products of the modes of production and of exchange. --engels",
    "Just as Darwin discovered the law of evolution in organic nature, so Marx discovered the law of evolution in human history --engels",
    "Mankind must first of all eat and drink, have shelter and clothing, before it can pursue politics, science, religion, art etc. --engels",
    "Men make their own history, but they do not make it as they please; they do not make it under circumstances chosen by themselves, but under circumstances directly encountered, given and transmitted from the past. --karl marx",
    "Society does not consist of individuals but expresses the sum of interrelations, the relations within which these individuals stand. --karl marx",
    "Mankind always sets itself only such tasks as it can solve; we will always find that the task itself arises only when the material conditions necessary for its solution already exist or are at least in the process of formation. --karl marx",
    "On a level plain, simple mounds look like hills; and the insipid flatness of our present bourgeoisie is to be measured by the altitude of its 'great intellects.' --karl marx",
    "Instead of the conservative motto, 'A fair day's wages for a fair day's work!', they ought to inscribe on their banner the revolutionary watchword, 'Abolition of the wage system!' --karl marx",
    "Do not be deluded by the abstract word Freedom. Whose freedom? Not the freedom of one individual in relation to another, but freedom of Capital to crush the worker. --karl marx",
    "The worker does not necessarily gain when the capitalist gains, but he necessarily loses with him. --karl marx",
    "He can work only with their permission, hence live only with their permission. --karl marx",
    "The fundamental essence of every state, with its “armed bodies of men”, police, courts and other trappings is that it serves the interests of one class in society, in the case of capitalism, the capitalist class. --alan woods",
    "Without the aid of the reformists, Stalinists and the trade union leaders, it would not be possible to maintain the capitalist system for any length of time. --alan woods",
    "All that is real in human history becomes irrational in the process of time. --engels",
    "The emancipation of woman will only be possible when woman can take part in production on a large, social scale, and domestic work no longer claims anything but an insignificant amount of her time. --engels",
    "What is good for the ruling class, is alleged to be good for the whole of society with which the ruling class identifies itself. --engels",
    "Philosophy is, in the last instance, class struggle in the field of theory. --Louis Althusser",
    "Misery, poverty and disease stalk the land. Teeming millions sinking into the abyss of deprivation and poverty graphically illustrate the historical, social and economic impasse and bankruptcy of capitalism.",
    "The ideas of Marx have never been more relevant than they are today. --alan woods",
    "This denial of progress in history is characteristic of the psychology of the bourgeoisie in the phase of capitalist decline. It is a reflection of the fact that, under capitalism progress has indeed reached its limits and threatens to go into reverse. --alan woods",
    "A man on the edge of a cliff does not reason. --lenin",
    "Those who deny the existence of any laws governing human social development invariably approach history from a subjective and moralistic standpoint. --alan woods",
    "Most people believe that society is fixed for all time, and that its moral, religious and ideological values are immutable, along with what we call “human nature”. But the slightest acquaintance with history shows that this is false. --alan woods",
    "History manifests itself as the rise and fall of different socio-economic systems. --alan woods",
    "Like individual men and women, societies are born, develop, reach their limits, enter into decline and are then finally replaced by a new social formation. --alan woods",
    "Capitalism in its youth was capable of colossal feats. That is no longer the case. ",
    "The defenders of capitalism cannot forgive Marx because, at a time when capitalism was in the stage of youthful vigour, he was able to foresee the causes of its senile degeneration. --alan woods",
    "And here it becomes evident, that the bourgeoisie is unfit any longer to be the ruling class in society, and to impose its conditions of existence upon society as an over-riding law. --karl marx",
    "The bourgeoisie is unfit to rule because it is incompetent to assure an existence to its slave within his slavery, because it cannot help letting him sink into such a state, that it has to feed him, instead of being fed by him. Society can no longer live under this bourgeoisie. --karl marx",
    "The bourgeoisie is systematically destroying the means of production in order to make them fit into the narrow limits of the capitalist system. --alan woods",
    "The modern bourgeois society that has sprouted from the ruins of feudal society has not done away with class antagonisms. It has but established new classes, new conditions of oppression, new forms of struggle in place of the old ones. --marx&engels",
    "All property relations in the past have continually been subject to historical change consequent upon the change in historical conditions. --marx&engels",
    "The distinguishing feature of Communism is not the abolition of property generally, but the abolition of bourgeois property. --marx&engels",
    "It has been objected that upon the abolition of private property, all work will cease, and universal laziness will overtake us. According to this, bourgeois society ought long ago to have gone to the dogs through sheer idleness; for those of its members who work, acquire nothing, and those who acquire anything do not work. --marx&engels",
    "Does it require deep intuition to comprehend that man’s ideas, views, and conception, in one word, man’s consciousness, changes with every change in the conditions of his material existence, in his social relations and in his social life? --marx&engels",
    "What else does the history of ideas prove, than that intellectual production changes its character in proportion as material production is changed? The ruling ideas of each age have ever been the ideas of its ruling class. --marx&engels",
    "The Communist revolution is the most radical rupture with traditional property relations; no wonder that its development involved the most radical rupture with traditional ideas. --marx&engels",
    "The Communists disdain to conceal their views and aims. They openly declare that their ends can be attained only by the forcible overthrow of all existing social conditions. Let the ruling classes tremble at a Communistic revolution. The proletarians have nothing to lose but their chains. They have a world to win. --marx&engels",
    "Revolution sometimes needs the whip of counterrevolution to push it forward. --karl marx",
    "Just as Charles Darwin explains that species are not immutable, and that they possess a past, a present and a future, changing and evolving, so Marx and Engels explain that a given social system is not something eternally fixed. That is the illusion of every epoch. --alan woods",
    "Every social system believes that it represents the only possible form of existence for human beings, that its institutions, its religion, its morality are the last word that can be spoken. That is what the cannibals, the Egyptian priests, Marie Antoinette and Tsar Nicolas all fervently believed. And that is what the bourgeoisie and its apologists today wish to demonstrate when they assure us, without the slightest basis, that the so-called system of “free enterprise” is the only possible system --alan woods",
    "History manifests itself as the rise and fall of different socio-economic systems. Like individual men and women, societies are born, develop, reach their limits, enter into decline and are then finally replaced by a new social formation. --alan woods",
    "The old optimism and blind faith in progress have been replaced by a profound sense of discontent with the present and of pessimism with regard to the future. This ubiquitous feeling of fear and insecurity is only a psychological reflection of the fact that capitalism is no longer capable of playing any progressive role anywhere. --alan woods",
    "A common argument against socialism is that it is impossible to change human nature; people are naturally selfish and greedy and so on. In reality, there is no such thing as a supra-historical human nature. What we think of as human nature has undergone many changes in the course of human evolution. --alan woods",
    "Man first begins to philosophise when the necessities of life are supplied. --Aristotle",
    "Hegel explained that necessity reveals itself through chance. The assassin’s bullet that killed Archduke Ferdinand in Sarajevo was an historical accident which served as a catalyst for the outbreak of hostilities between the great powers which had been building up as a result of insurmountable economic, political and military contradictions between the great European powers before 1914. --alan woods",
    "Marxism is much more than a political programme and an economic theory. It is a philosophy, the vast scope of which covers not only politics and the class struggle, but the whole of human history, economics, society, thought and nature. --alan woods",
    "The fight against the power of the ruling class cannot stop in the factories, the streets, parliament and local councils. We must also carry out the battle in the ideological field, where the influence of the bourgeoisie is no less pernicious and harmful by being hidden under the guise of a false impartiality and a superficial objectivity. Marxism has a duty to provide a comprehensive alternative to the old and discredited schemes. --alan woods",
    "Today, the ideology of the bourgeoisie is in the process of disintegration, not only in the field of economics and politics but also in that of philosophy. In the period of its ascent the bourgeoisie was capable of producing great thinkers like Hegel and Kant. In the period of its senile decay it produces nothing of value. --alan woods",
    "Isolated from the real conditions of the masses, living in the rarefied atmosphere of parliaments and Byzantine temples of bureaucracy are those who imagine that they are the Masters of society. Confident in their belief that they alone have the Divine Right to rule, they are only dimly aware of the forces that are being prepared for their overthrow. --alan woods",
    "The future socialist planned economy will not be based on backwardness, as was the regime established by the Bolshevik Party of Lenin and Trotsky in November 1917. It will draw on the colossal advances of industry, science and technology, which will become the servants of human needs, not the slaves of the profit motive. --alan woods",
    "Men cling passionately to old traditions and display intense reluctance to modify customary modes of behavior, as innovators at all times have found to their cost. The dead-weight of conservatism, largely a lazy and cowardly distaste for the strenuous and painful activity of real thinking, has undoubtedly retarded human progress... --V. Gordon Childe",
    "The Marxist view of history and prehistory is admittedly material determinist and materialist. But its determinism does not mean mechanism. The Marxist account is in fact termed 'dialectical materialism.' It is deterministic in as much as it assumes that the historical process is not a mere succession of inexplicable or miraculous happenings, but that all the constituent events are interrelated and form an intelligible pattern. --V. Gordon Childe",
    "The dialectical method allows us to penetrate beyond appearances and see the processes that are taking place beneath the surface. The dialectic is first of all the science of universal interconnection. It provides a comprehensive and dynamic view of phenomena and processes. It analyses things in their relationship, not separately; in their motion, not statically; in their life, not death. --alan woods",
    "Dialectics permits us to penetrate beyond the “given”, the immediate, that is, the world of appearance, and to uncover the hidden processes that are taking place beneath the surface. We point out that behind the appearance of calm and absence of movement, there is a process of molecular change, not only in physics but also in society and in the psychology of the masses. -alan woods",
    "At the same time that Marx was carrying out a revolution in the field of political economy, Darwin was doing the same in the field of biology. It is no accident that while Darwin’s work aroused a storm of indignation and incomprehension, it was immediately recognised by Marx and Engels as a masterpiece of the dialectic, although Darwin himself was unaware of it.  --alan woods",
    "The old society is dying on its feet, and a new society is struggling to be born. But those who have derived vast riches from it will never accept the inevitability of its demise. Sooner than see it sink into oblivion, the ruling class would prefer to drag the whole of society down with it.  --alan woods",
    "The prolongation of the death agony of capitalism constitutes a mortal threat to human culture and civilisation. Our task is to assist in the birth of the new society, to ensure that it takes place as swiftly and painlessly as possible, with the smallest cost to humanity. --alan woods",
    "It is an obvious fact that the banks and big monopolies are now dependent on the state for their survival. As soon as they were in difficulties, the same people who used to insist that the state must play no role in the economy, ran to the government with their hands out, demanding huge sums of money. --alan woods",
    "The steady progress of technology is the precondition for the final emancipation of man, the abolition of poverty and illiteracy, ignorance, disease and the domination of nature by man through the conscious planning of the economy. The road is open to conquest, not only on Earth, but in space. --alan woods",
    "The only alternatives open to humanity are clear: either the socialist transformation of society, the elimination of the political and economic power of the bourgeoisie and the initiation of a new stage in the development of human civilisation, or the destruction of civilisation, and even of life itself. --alan woods",
    "For the past two decades we have been fed a steady diet of economic propaganda which assured us that the idea of a planned socialist economy was dead, and that the “market”, left to its own devices, would solve the problem of unemployment, bringing about a world of peace and prosperity. Now, following the crash of 2008, the truth is beginning to dawn on people that the existing order is incapable of assuring even the most basic of human needs. --alan woods",
    "The central point of the Communist Manifesto—and herein lies its revolutionary message—is precisely that the capitalist system is not forever. This is the element which the apologists of our present system find most difficult to swallow. Naturally! It is the common delusion of every socio-economic system throughout history that it represents the very last word in social progress. --alan woods",
    "Real socialism must be based on democracy—not the fake formal democracy that exists in Britain and the USA, where anybody can say what they want as long as the big banks and monopolies decide what happens—but a genuine democracy based on the control and administration of society by working people themselves. --alan woods",
    "Is it really true that there is no alternative to capitalism? No, it is not true. The alternative is a system based on production for the needs of the many and not the profit of the few; a system that replaces chaos and anarchy with harmonious planning; that replaces the rule of a minority of wealthy parasites with the rule of the majority who produce all the wealth of society. The name of this alternative is socialism. --alan woods",
    "Twenty years ago Francis Fukuyama spoke of the end of history. But history has not ended. In fact, the real history of our species will only begin when we have put an end to the slavery of class society and begun to establish control over our lives and destinies. This is what socialism really is: humanity’s leap from the realm of necessity to the realm of freedom. --alan woods",
    "Neither weep nor laugh, but understand! --Spinoza",
    "After the fall of the Soviet Union, the defenders of the old order were jubilant. They spoke of the end of socialism, and even the end of history. They promised us a new era of peace, prosperity and democracy, thanks to the miracles of the free market economy. Now, only fifteen years later, those dreams are reduced to a heap of smoking rubble. Not one stone upon another remains of these illusions. --alan woods",
    "Life is not an easy matter… You cannot live through it without falling into prostration and cynicism unless you have before you a great idea which raises you above personal misery, above weaknesses, above all kinds of perfidy and baseness. --trotsky",
    "God has always been hard on the poor. --Marat",
    "It is the height of stupidity to claim that men who for a thousand years have had the power to berate us, to fleece us and to oppress us with impunity, will now agree, with good grace, to be our equals. --Marat",
    "The secret of freedom lies in educating people, whereas the secret of tyranny is in keeping them ignorant. --Robespierre",
    "Man has the right to deal with his oppressors by devouring their palpitating hearts. --Marat",
    "The bourgeoisie are today evading taxation by bribery and through their connections; we must close all loopholes. --lenin",
    "Communism cannot be imposed by force. --lenin",
    "The proletarian revolution is impossible without the sympathy and support of the overwhelming majority of the working people. --lenin",
    "You can become a Communist only when you enrich your mind with a knowledge of all the treasures created by mankind. --lenin",
    "All over the world, wherever there are capitalists, freedom of the press means freedom to buy up newspapers, to buy writers, to bribe, buy and fake “public opinion” for the benefit of the bourgeoisie. --lenin",
    "Victory will belong only to those who have faith in the people, those who are immersed in the life-giving spring of popular creativity. --lenin",
    "For the state to wither away completely, complete communism is necessary. --lenin",
    "We set ourselves the ultimate aim of abolishing the state, i.e., all organized and systematic violence, all use of violence against people in general. --lenin",
    "Freedom in capitalist society always remains about the same as it was in the ancient Greek republics: freedom for the slave-owners. --lenin",
    "We stand for an alliance with all countries without exception. --lenin",
    "When we are victorious on a world scale I think we shall use gold for the purpose of building public lavatories in the streets of some of the largest cities of the world. --lenin",
    "One cannot live in society and be free from society. --lenin",
    "Discrimination among citizens on account of their religious convictions is wholly intolerable. Even the bare mention of a citizen’s religion in official documents should unquestionably be eliminated. --lenin",
    "The worker is becoming impoverished absolutely, i.e., he is actually becoming poorer than before; he is compelled to live worse, to eat worse, to suffer hunger more, and to live in basements and attics. --lenin",
    "Our aim is to achieve a socialist system of society, which, by eliminating the division of mankind into classes, by eliminating all exploitation of man by man and nation by nation, will inevitably eliminate the very possibility of war. --lenin",
    "To decide once every few years which members of the ruling class is to repress and crush the people through parliament — this is the real essence of bourgeois parliamentarism, not only in parliamentary- constitutional monarchies, but also in the most democratic republics. --lenin",
    "To be successful, insurrection must rely not upon conspiracy and not upon a party, but upon the advanced class. That is the first point. Insurrection must rely upon a revolutionary upsurge of the people. That is the second point. --lenin",
    "America has become one of the foremost countries in regard to the depth of the abyss which lies between the handful of arrogant multimillionaires who wallow in filth and luxury, and the millions of working people who constantly live on the verge of pauperism. --lenin",
    "I don't care what becomes of Russia. To hell with it … All this is only the road to a World Revolution. --lenin",
    "Now Edward Snowden has become the latest fugitive of US imperialism, his only crime being that he told embarrassing truths about the US government. --alan woods",
    "Genuine libertarianism is a utopian fantasy. Capitalism is a system that is inherently unstable and will always need a general fund of 'socialism for the rich' when they run into trouble. --Thomas Anderson",
    "One of its key features is its decentralised structure that prevents regulation by a central authority or bank. It is this aspect of Bitcoin that is trumpeted by utopian libertarians who see it as the embryo of capitalism without regulation or control, a dream that is already being scuppered by the realities of the modern world. --Ben Gliniecki",
    "In Britain, the state mystification is deliberately cultivated through ceremony, pomp and tradition. In the USA it is cultivated by other means: the cult of the President, who represents state power personified. In essence, however, every form of state power represents the domination of one class over the rest of society. --Alan Woods",
    "Dialectical understanding allows us to sweep aside all arguments that there are unchangeable situations like the subjugation of peasants to nobility in feudal times or workers to capitalists in modern times.",
    "There is no royal road to science, and only those who do not dread the fatiguing climb of its steep paths have a chance of gaining its luminous summits --karl marx",
    "This may look good on paper, but the proof of the pudding is in the eating; and in the complex and dynamic reality of the modern economy Bitcoin seems to be leaving libertarians with an unpleasant taste in their mouths. --Ben Gliniecki",
    "Under capitalism centralisation is inevitable. As has already been pointed out, central banks are not the result of conspiracy or accident, but the inevitable product of economic development and trade. The utopians behind Bitcoin dream of giving people power over their own lives; but as long as capitalism exists that will never be possible. --Ben Gliniecki",
    "Bitcoin represents little more than an anarcho-capitalist pipe-dream and a speculator’s playground, and in that sense reflects the failures of capitalism and the inadequacy of anarchist, libertarian economic ideas. --Ben Gliniecki",
    "In this enormously turbulent period that we are entering into, fashionable speculative bubbles and trendy anarcho-libertarian ideas will disappear into insignificance and be overshadowed by open class struggle and socialist revolution. --Ben Gliniecki",
    "Marxists have consistently opposed individual terrorism on the grounds that it doesn’t work, because it does not involve the mass of workers in the struggle, but also for the practical reason that it gives the state the excuse to pile up repressive measures that can be used also against the working class. --Tony Healy",
    "Periods of economic crises do not generate but are caused by the economic and political contradictions of capitalism. --Nivedita Majumdar",
    "The obscene concentration of wealth in the two decades preceding the 2008 crisis shows that there is no mechanism to push for a sustainable, let alone fair, allocation of resources within capitalism. --Nivedita Majumdar",
    "Liberals’ deflated hopes in President Obama are reminders that any political entity, regardless of its assertions of autonomy, that directly or indirectly relies on capital must capitulate to capital’s logic and interests. --Nivedita Majumdar",
    "A new scientific truth does not triumph by convincing its opponents and making them see the light, but rather because its opponents eventually die, and a new generation grows up that is familiar with it. --Max Planck",
    "Only dialectical materialism can explain the laws of change, which sees the world not as a state of ready-made things, but made up of complex processes, which go through an uninterrupted transformation of coming into being and passing away. --Rob Sewell",
    "The incongruity between what capitalism professes to be and the reality of capitalism is becoming increasingly apparent. --Pankaj Mehta",
    "An uprising that is devoid of ideas and vision is never a threat to ruling elites. Social upheaval without clear definition and direction, without ideas behind it, descends into nihilism, random violence and chaos. --Chris Hedges",
    "Revolutions, when they erupt, appear to the elites and the establishment to be sudden and unexpected. This is because the real work of revolutionary ferment and consciousness is unseen by the mainstream society, noticed only after it has largely been completed. --Chris Hedges",
    "Once ideas shift for a large portion of a population, once the vision of a new society grips the popular imagination, the old regime is finished. --Chris Hedges",
    "By the time ruling elites are openly defied, there has already been a nearly total loss of faith in the ideas—in our case free market capitalism and globalization—that sustain the structures of the ruling elites. --Chris Hedges",
    "Ruling elites, once the ideas that justify their existence are dead, resort to force. It is their final clutch at power. --Chris Hedges",
    "As the bankruptcy of corporate capitalism and globalization is exposed, the ruling elite are increasingly nervous. They know that if the ideas that justify their power die, they are finished. --Chris Hedges",
    "Human history is like palaeontology. Owing to a certain judicial blindness even the best intelligences absolutely fail to see the things which lie in front of their noses. Later, when the moment has arrived, we are surprised to find traces everywhere of what we failed to see. --karl marx",
    "It has often been stated that the correctness of Marxist theory - in its ability to predict the general course of development within the economy and society - demonstrates the superiority of foresight over astonishment. --Lee Singh Gill",
    "All the horrors we see around us are the painful travails of a new world that is struggling to be born. Capitalist society is rotten to the very marrow. It is sick unto death. It cannot be saved, and all the attempts to prolong its existence merely prolong its death agony, provoking new horrors for humanity: violence, wars, terrorism and death for millions of people. The capitalist system must die in order that humanity may live. --Alan Woods",
    "The old society is dying on its feet and the new society is struggling to be born. The task of the Marxists is to do everything in our power to cut short this convulsive process that is threatening to undermine civilisation and human culture. --Alan Woods",
    "Capitalism in by its very nature a system of chaos, of conflict and of struggle whereby the ruling class of different nations compete to undercut one another and where businesses and companies in one country after another have to look out for their own interests. --Lee Singh Gill",
    "Whilst a few bourgeois economists may approach similar conclusions as the Marxists, they fail to see the underlying processes at work; for to do so would be to accept their obsolete historical position within society. The bourgeoisie represent a class which is at a historical dead end. --Lee Singh Gill",
    "Only when the working class conquers political power, sweeping away the decaying remnants of bourgeois and feudal society around the world and set itself upon the tasks of socialist construction will mankind be able to free itself from the desolation and misery which is inflicted upon it and we can start to further the advance of civilisation for all. --Lee Singh Gill",
    "Marxists, like feminists, fight to end the oppression of women, although we see this struggle as part of a struggle against all forms of oppression.",
    "The battle between exploited and exploiter – a relationship defined by each individual’s position in the economic process – ultimately governs the ideology, institutions and prejudices of any given society. It is therefore to the existence of class society we must look for the origins of sexism, rather than to supposed inherent traits in either men or women.",
    "The past century has seen many strides forward for women as many more have entered into higher education, pursued careers, and rights to abortion and divorce have been gained. However we must also recognise that women remain an exploited group and that the form of this exploitation has changed in tandem with changes in the capitalist system. --Rachel Gibbs&Claire Martin",
    "With socialism will come the end of all of the many forms of oppression used by the capitalist system, including that faced by women. While capitalism relied upon strict gender roles, socialism would do away with this repressive pigeonholing of individuals. --Rachel Gibbs&Claire Martin",
    "A socialist society would have no need for the nuclear family, often at the forefront of the exploitation of women, necessary for the passing on of private property and the raising of the next generation of workers for the capitalist. --Rachel Gibbs&Claire Martin",
    "Capitalism and oppression are intricately linked. Sexism, as well as racism, ableism, homophobia and all other oppressions, derives from class oppression; therefore, in order to tackle any one of these oppressions we must also fight capitalism. --Rachel Gibbs&Claire Martin",
    "The oppression of women did not always exist. In fact, the family as we know it today has not always existed but is a transient form. Marxism explains that it arose together with class society, private property and the state. The oppression of women is only as old as the division of society into classes. Its abolition is therefore dependent on the abolition of classes, that is, on the socialist revolution. --alan woods",
    "The ruling class will continue its policy of “divide and rule,” a tool to split the unity of the working class. Included in this is the use of homophobia and the attempt to divide people on the basis of sexuality. --Tom Trottier",
    "The right wing claims that homosexuality is “unnatural.” If by this is meant that it is not found in nature, that is clearly false. Homosexual activity can be observed in many animals. --Tom Trottier",
    "It should be understood that many aspects of gender roles and sexual identities are created by society. Various societies over time have defined gender roles and sexual identities in different ways. --Tom Trottier",
    "Engels explains how as society developed, group marriage gave way to monogamy, private property of the means of production developed, and children began to trace their lineage through the father as opposed to the mother. This would allow the man to bequeath his property to his children. --Tom Trottier",
    "Increasingly, society was divided into the individual family: one woman and one man and their children. There were strict penalties if the woman violated the “sanctity of marriage,” as the man wanted to ensure that his property would be passed on to his children, but of course, he was allowed many alternative distractions. --Tom Trottier",
    "Modern American capitalism was also quite ruthless in its oppression of gays, lesbians and transgender individuals. In addition to the anti-sodomy laws and police prosecution, homosexuality was given extreme social disapproval. Any ability to live one’s life as a homosexual had to be done in an underground manner. --Tom Trottier",
    "Marxists understand that capitalist ideology also exerts its influence on science and medicine in order to perpetuate, justify, and enforce its own worldview. This was the case with official, mainstream psychiatry in America, which listed homosexuality as a disorder in its diagnostic manual until 1974! --Tom Trottier",
    "There is no way to know precisely how human relationships, especially romantic ones, will develop under socialism. However, we can be certain that people would be free to explore their own sexuality, free from state or religious coercion, and that sex would not be just another commodity, as it can be under capitalism. --Tom Trottier",
    "It is estimated that world hunger could be wiped out with just $30 billion per year, while US Fortune 500 companies alone have $2 trillion in uninvested cash assets sitting in US banks, and another $2 trillion or more squirreled away in offshore accounts. And according to economist Jeffrey Sachs, extreme poverty worldwide could be eliminated with just $175 billion per year over 20 years, while world military spending amounts to a mind-boggling $1.75 trillion each and every year.",
    "With all due respect to those who with the deepest sincerity want to “do something” about ALS and have made sacrifices to donate to charity, the real utopia is to imagine that the world’s literal and figurative ills can be cured by private foundations, gimmicks, and celebrities dumping ice on their heads.",
    "When people first begin to question the existing order, conspiracy theories offer a simple explanation. As Frank Spotnitz, a writer for the X-Files, explained, conspiracy theories offer “a magic key that fits all the pieces together.” For most people, things don’t seem to be working properly in society. And yet we have all been told our entire lives that this system works. --Josh Lucker",
    "Conspiratorial logic is simple—at least on the surface—and plays into Americans’ philosophical predisposition towards pragmatism and empiricism. However, that does not make the line of thought correct. By contrast, Marxism offers a systemic and scientific explanation for the problems facing society. --Josh Lucker",
    "The rule of the minority of owners over the majority of workers is not dependent upon any “evil” intentions or backroom “cigarette-smoking men,” but rather, flows from the workings of the capitalist system itself. --Josh Lucker",
    "While conspiracy theories typically view history through the lens of an oppressed majority vs. an exploitative minority, they tend to view this relationship not as a systemic arrangement—i.e. as the result of property and social relations in class society—but rather as unique “connections” of “bad men,” “behind the scenes,” preventing society from functioning “properly.” --Josh Lucker",
    "Conspiracy theories vary widely, but this reliance on “connecting the dots” is a universal feature of nearly all of them, and separates them from any genuine scientific understanding of social relations. --Josh Lucker",
    "The capitalist class relies on two forces to maintain its rule. On the one hand, there are the forces of the state apparatus. This includes, in the main, the armed bodies of men and women, the military, the police, the courts and the prisons. Aside from this very material force, but also very important, is the force of what Marxists call “ideology.” --Josh Lucker",
    "Capitalist ideology is taught throughout virtually the entire education system, broadcast over virtually the entire media, reinforced through our workplace interactions, and in religious worship, etc. Unless otherwise questioned, the basic assumptions of capitalist society, i.e. the ideas of the capitalist class, are simply accepted to be the “norm.” --Josh Lucker",
    "Nowadays, many on the Left spend their time arguing and debating over a wide variety of conspiracy theories. Ultimately, however, this does not pose any real threat to capitalism, as it does not call into question the system itself, but rather elements that have “gone rogue” within the limits of that system. Most conspiracy theories start from the premise that capitalism is the only way society can be organized, and conclude that things would be hunky-dory if only the conspirators were exposed. --Josh Lucker",
    "To substitute elaborate conspiracies for the real, living class struggle does not help clarify the true nature of capitalism or help in ideologically arming the working class to end it once and for all. --Josh Lucker",
    "It is clear that all over the world, class struggle is intensifying as capitalism crushes the lives of ordinary people in order to be able to sustain the privileges of a tiny elite, showing ever more the true barbaric face of the capitalist system.",
    "Journalism does not exist in a vacuum. Unless journalists adopt the Marxist analysis of class struggle as a revolutionary praxis, they will present the capitalist view by default. --Khawer Khan",
    "The sharp turns and sudden changes that are being experienced in countries across the world are causing more people to think about and engage with politics, not as careerists or petty reformists, but as revolutionaries who reject this system in decline and are ready to fight for a fundamental transformation of society. --Ben Gliniecki",
    "“The ultimate reason for all real crises always remains the poverty and restricted consumption of the masses, in the face of the drive of capitalist production to develop the productive forces as if only the absolute consumption capacity of society set a limit to them,” --karl marx",
    "Never has it been clearer that Marx was right and we need a new society. And yet, it is this point that is the most contentious. Rolling Stone, the New York Times, even the Economist, have all released commentary praising the power of Marx’s analysis. However, they all focus on his critique of capitalism and balk at any notion of what is to replace it. ",
    "Capitalism is not in crisis because it is working aberrantly, it is in crisis because it is working exactly as it is supposed to.",
    "There is no more modern book than Marx and Engels' Manifesto. It explains the division of society into classes; it explains the phenomenon of globalization, global crises of overproduction, the nature of the state and the fundamental motor forces of historical development. --alan woods",
    "Many Americans are justifiably horrified by the atrocities being perpetrated by the ISIS gangsters. But imperialist intervention, which led to this wreck in the first place, is no solution. There is no short-term way out. Only a socialist revolution can transform the region and the world. --John Peterson",
    "Given the character of capitalism, the struggle of the working class and the movement towards socialism must be international. The struggle for socialism is international or it is nothing. There can be no such thing as “socialism in one country.” The task of the socialist revolution is the abolition of private ownership of the means of production and the nation state, a product of capitalism. --Rob Sewell",
    "The end of the world is nigh. This is not a new phenomenon. The same doom-laden outlook was present in the period of decline of the Roman Empire and at the close of the Middle Ages. In each case, the idea that the world was coming to an end reflected the fact that a particular system of society had become exhausted and was on the point of extinction. What was imminent was not the end of the world, but the collapse of slavery and feudalism. --alan woods",
    "This vulgar “theory” of equilibrium is the real origin of the “efficient market hypothesis”, which stated that the economy left unaided would reach an optimum state. This was the Credo of modern political economy – until its falsity was exposed by the greatest collapse of the productive forces for generations in 2008-9. --Rob Sewell",
    "Nowadays this same “law” is the basis for the “efficient market hypothesis” – the theory put forward by the most ardent supporters of the free market – that suggests that, if left to its own devises, in the long run market forces will solve all problems and will always find an “equilibrium” in which supply meets demand. But as Keynes was keen to point out, “in the long run we are all dead.” --Adam Booth",
    "They had worked out a wonderful new theory called the “efficient market hypothesis.” Actually, there is nothing new about it at all. It amounts to the old idea that: “Left to itself the market will solve everything. It will automatically balance itself out. As long as the government doesn’t interfere, sooner or later everything will be fine.” To which, John Maynard Keynes issued the very celebrated reply, “Sooner or later we’re all dead.” --alan woods",
    "For the last twenty years the bourgeois economists boasted that there would be no more boom and slump, that the cycle had been abolished. It is an actual fact that for decades, the bourgeois economists never predicted a single boom and never predicted a single slump. --alan woods",
    "The existence of a nationalised planned economy gave the USSR an enormous advantage in World War II. Despite the criminal policies of Stalin, which nearly brought about the collapse of the USSR at the beginning of the war, the Soviet Union was able to swiftly recover and rebuild its industrial and military capacity. --alan woods",
    "The Russians were able to dismantle all their industries in the West – 1,500 factories – put them on trains and ship them east of the Urals where they were beyond the reach of the Germans. In a matter of months the Soviet Union was out-producing the Germans in tanks, guns and airplanes. This demonstrates beyond doubt the colossal superiority of a nationalised planned economy, even under a bureaucratic regime. --alan woods",
    "The USSR, by mobilising the immense power of a planned economy, managed to out-produce and outgun the mighty Wehrmacht. That is the secret of its success. --alan woods",
    "For every environmentally destructive company, product, or process that we shut down, another will return to its place—until we change the system that gives them their existence.",
    "We struggle not only against environmental degradation, homophobia, racism, low wages, and more, but link all of these struggles with the need for socialism as the only solution capable of resolving all these problems.",
    "The individual efforts of consumers cannot defeat the powerful structural incentives that drive environmental destruction. The structure itself must be fundamentally transformed. Capitalism is not something that can be reformed. A lion cannot be reformed into eating celery. If we want an animal that does not have a lion’s appetite, we need a different animal altogether!",
    "It is only now, in the epoch of capitalism, that our tools have become so powerful that they threaten to destroy the system on which everything, including ourselves, depends. However, we are not doomed to be unsustainable. Humans are very rational, creative, and intelligent beings. We are able to recognize a need and adapt accordingly. The problem is that the capitalist economy is not subject to our intelligence or reason. It is subject to the anarchy of an inhumane market and is not consciously planned in harmony with the environment. What is needed is the next step in human development.",
    "Is it really acceptable that in the second decade of the 21st century the destinies of millions of men and women, of whole countries and states, should be determined in the same way as a gambling den? Is it really true that humankind cannot think of any better system than this? “There is no alternative” is in fact a vicious libel on the human race. And an alternative certainly does exist, but not on the basis of capitalism. --alan woods",
    "We must understand that capitalism is not a reversible process. It has its own laws of development that inevitably tend towards instability, and by extension to revolution. In wanting to turn back the clock of social development to a fictitious “ideal” form of libertarian capitalism, libertarians wants the opposite of that change: counter revolution! --Shane Jones",
    "Simply put, libertarians dreams of the current state of society without all its problems. However, the war, the  economic crisis facing millions, sky high incarceration rates, etc., all stem directly from the rule of the capitalists. --Shane Jones",
    "It is a rather sickening irony that a man who claimed he was opposed to big government was only too happy to advise the military dictator and Chilean coup leader General Pinochet in economic policies during the 1970s and at the same time the Stalinist Chinese regime all in order to bring about raw-blooded capitalism. --Michael Roberts",
    "Friedman is thus honoured in the church of capitalism. However, it is no accident that many of his policies have never been adopted nor will they be. The reality is that a completely free market without regulation would lead to anarchy and chaos for the capitalist system. --Michael Roberts",
    "The capitalist apologists and leaders will mourn Milton Friedman's passing, but not carry out his policies. The working class will remember the damage he has done to millions of people's lives. --Michael Roberts",
    "It is clear today that neither the Keynesians nor the monetarists have any answers. Unlike the optimism felt by the bourgeoisie in the years of boom, now there is nothing but pessimism amongst the ruling class. The monetarists and Keynesians are both wrong and they are both right; but both only see one side of the problem. --Adam Booth",
    "Rather than seeing the mathematical models of the economy as the generalised abstractions and approximations of an infinitely complex reality that they really are, modern bourgeois economists think that the equations are the reality and that the economy must conform to their models. Rather than making the theories fit the facts, the facts are forced to fit the theories. --Adam Booth",
    "Organic nature grew out of dead nature; living nature produced a form capable of thought. First, we had matter, incapable of thought; out of which developed thinking matter, man. If this is the case—and we know it is, from natural science—it is plain that matter is the mother of mind; mind is not the mother of matter. --Nikolai Bukharin",
    "The materialist philosophy, which is at the root of both the scientific method and of Marxism, explains that there is no such thing as the “unknowable”, but simply that which is currently unknown. --Adam Booth",
    "The laws of chemistry, describing interactions at the atomic and molecular level, cannot be used to predict the behaviour of a whole biological organism. Likewise, knowledge of biological laws does not give much insight into the emergent patterns and general laws that can be observed in history, society, and the economy; for this, one requires the materialist method of Marxism.",
    "All theories are relative truths, approximations of the dynamics of motion within limits. Scientific laws in nature, as with any laws in history, the economy, or society, are not cast-iron laws, but are more accurately described as “tendencies”: generalisations arising from the processes of matter in motion, in which similar conditions produce similar results. There is no law that is absolute, universally applicable to all situations at all times and at all scales.",
    "The dialectical materialism of Marxism, confirmed by all of modern science, including the ideas of chaos theory, demonstrates how matter in motion is fundamental, our laws being only approximate descriptions of this complex dynamism and mutual interaction.",
    "The so-called democracy that exists in the USA and Europe is only a fig-leaf to disguise the reality of the dictatorship of the banks and big business. The only difference with Mexico is that those countries are richer and the bankers and capitalists have had longer to perfect the mechanism for deceiving the masses with the illusion of democracy and the “rule of law”. --alan woods",
    "After his friend Karl Marx (who died in 1883), Engels was the finest scholar and teacher of the modern proletariat in the whole civilised world.... In their scientific works, Marx and Engels were the first to explain that socialism is not the invention of dreamers, but the final aim and necessary result of the development of the productive forces in modern society. All recorded history hitherto has been a history of class struggle, of the succession of the rule and victory of certain social classes over others. --lenin",
    "For almost a century now, the motor force of innovation has not been capitalist competition, but planning and public ownership. Capitalism, far from developing science and technology, has become an enormous fetter on the development of the productive forces. Private ownership over the means of production has become a gigantic barrier to innovation and ingenuity and must be replaced by a plan of production under the democratic control of society itself.",
    "It is not technology itself, but the use of technology under capitalism, implemented in an anarchic and unplanned way, which leads to mass unemployment, and which in turn places pressure on those still in work to accept lower wages, as competition for the remaining jobs increases.",
    "It is a well-known fact that science under capitalism becomes less and less scientific, the closer it gets to society. The so-called social sciences are not really sciences at all, but ill-concealed attempts to justify capitalism, or at least to discredit Marxism, which boils down to the same thing.",
    "People are beginning to grasp the fact that in the first decade of the 21st century, progress has indeed come to a full stop. But this merely reflects the impasse of capitalism, which has long ago exhausted its potential for progress and become a monstrous obstacle in the path of human advance. To this extent - and only to this extent - one can say that it is impossible to talk about progress.",
    "We live in capitalism. Its power seems inescapable. So did the divine right of kings. Any human power can be resisted and changed by human beings. --Ursula K. Le Guin",
    "Those who stubbornly maintain that they have no philosophy are mistaken. Nature abhors a vacuum, it is said. Those who lack a coherently worked-out philosophical standpoint will inevitably reflect the ideas and prejudices of the society and the milieu in which they live. That means, in the given context, that their heads will be full of the ideas they imbibe from the newspapers, television, pulpit and schoolroom, which faithfully reflect the interests and morality of existing capitalist society. --Alan Woods",
    "Only international socialism, free from the constraints of capitalism and private ownership of the means of production, with universal, quality education for every human on the planet, and free exchange of all technology and research, can usher in a new age in which humanity can look to conquer our own destiny, from the Earth to the stars.",
    "The Earth has been described as being our one space ship, with only one crew. And unless we overthrow the capitalist system, our spaceship is in jeopardy. Capitalism threatens the environment through pollution and unplanned usage of natural resources. It threatens human culture through the destruction of public education and cuts in funding for the arts and sciences, not to mention the destruction caused by wars and the shuttering of the means of production.",
    "We are constantly bombarded with the myth that capitalism drives innovation, technology, and scientific advancement. But in fact, the precise opposite is true. Capitalism is holding back every aspect of human development, and science and technology is no exception. --Mike Palecek",
    "The history of science is characterised by the most fierce partisanship, at times bordering on fanaticism, in defence of particular schools of thought, which put themselves forward as the protagonists of an absolute truth, and who do in fact embody the maximum point reached by human knowledge at a given point in time. Only the further development of science itself reveals the limitations and inner contradictions of a given theory, which is then negated by its opposite, which is itself negated, and so on ad infinitum.",
    "Man’s earliest attempts to explain the world and his place in it were mixed up with mythology. The Babylonians believed that the god Marduk created Order out of Chaos, separating the land from the water, heaven from earth. The biblical Creation myth was taken from the Babylonians by the Jews, and later passed into the culture of Christianity. The true history of scientific thought commences when men and women learn to dispense with mythology, and attempt to obtain a rational understanding of nature, without the intervention of the gods. From that moment, the real struggle for the emancipation of humanity from material and spiritual bondage begins.",
    "Homer and Hesiod have ascribed to the gods every deed that is shameful and dishonourable among men: stealing and adultery and deceiving each other…The Ethiopians make their gods black and snub-nosed, and the Thracians theirs grey-eyed and red-haired…If animals could paint and make things, like men, horses and oxen too would fashion the gods in their own image. --Xenophanes of Colophon",
    "Let us leave pessimism to the bourgeois and their reformist hangers-on. They have every reason to be pessimistic! But we have every right to be optimistic. We welcome the New Year with the spirit that our Age requires: a spirit of enthusiasm for the battle that impends, the battle between a worn-out, decaying and degenerate Order that has outlived its usefulness and is ripe to be overthrown, the battle of the future against the past, the battle for a new and better world: the battle for socialism.",
    "Every social system which enters into a phase of irreversible decline always presents its own demise as the end of the world, or, better still, the universe. Yet the universe still carries on, indifferent to the destiny of this or that temporary social formation on earth. Humankind continues to live, to fight and, despite all reverses, to develop and progress. So that every period sets out on a higher level than before. And there is, in principle, no limit to this process.",
    "Capital is reckless of the health or length of life of the laborer, unless under compulsion from society. --Karl Marx",
    "Natural science will in time incorporate into itself the science of man, just as the science of man will incorporate into itself natural science: there will be one science. --karl marx",
    "Freedom of expression is routinely and uncritically heralded as our society's proudest achievement to be defended at all costs. It is always assumed that, essentially, we possess this freedom, and it is only necessary to preserve it in one way or another. In truth, under capitalism there is no such thing as free expression nor a free press, for capital decides everything. --Daniel Morley",
    "There is no such thing, at this date of the world's history, as an independent press. You know it and I know it. There is not one of you who dares to write your honest opinions, and if you did, you know beforehand that it would never appear in print. I am paid weekly for keeping my honest opinions out of the paper I am connected with. Others of you are paid similar salaries for similar things, and any of you who would be so foolish as to write honest opinions would be out on the streets looking for another job. --John Swinton"




  ],
  "Ignored_Subreddits": [
  	"politics",
    "madeupsubreddit1234"

  ],
  "SRSs": [
    "Shitstatistssay",
    "ShitPoliticsSays",
    "redditlogic",
	"ffsreddit",
	"richbroke",
    "liberalreality",
    "PanicHistory",
    "biggomno"
  ], 
  "KEYWORDS": [    
    "karl marx",
    "marxism",
    "lenin",
    "trotsky",
    "socialism",
    "capitalism",
    "dialectics",
    "metabolic rift",
    "bourgeois",
    "proletariat",
    "communism",
    "world revolution",
    "commodity fetishism",
    "class consciousness",  
    "false consciousness",
    "lumpenproletariat",
    "means of production",
    "mode of production",
    "petit bourgeoisie",
    "relations of production",
    "counter-revolution",
    "counter revolution",
    "bolsheviks",
    "bolshevism",
    "Bonapartism",
    "capitalist class",
    "historical materialism",
    "labour theory of value",
    "neo-liberalism",
    "planned economy",
    "reformism",
    "dictatorship of the proletariat",
    "internationalism",
    "revolutionary situation",
    "socialist revolution",
    "proletarian revolution",
    "permanent revolution",
	"proletarian",
	"working class",
	"Soviet",
	"althusser",
	"dietzgen",
    "reification",
	"rosa luxemburg",
	"gordon childe",
	"october revolution",
	"agricultural revolution",
	"paul lafargue",
	"general strike",
	"labor union",
	"wage slavery",
	"labor economics",
	"labor theory of value",
	"deleonism",
	"de leonism",
	"das kapital",
	"communist manifesto",
	"communist revolution",
	"cybersyn",
	"marxist",
	"karl marx",
	"friedrich engels",	
    "worker ownership",
    "transformation problem",
    "socially necessary labour time",
    "socialist",
    "neolithic revolution",
    "dialectical materialism",
    "trotskyism",
    "dialectical",
    "libertarian"

	
	
  ],
  "MORONIC_SUBREDDITS": [
    "WhiteRights",
    "Anarcho_Capitalism",
    "christian_ancaps",
    "shitstatistssay",
    "Libertarian",
    "austrian_economics",
    "liberty",
    "votethirdparty",
    "shitpoliticssays",
    "MarketAnarchism",
    "libertarianbestof",
    "mises",
    "whowillbuildtheroads",
	"MensRights",
	"MensRightsMeta",
	"MRSelfPostCopies",
	"MensRightsLinks",
	"MensRightsLaw",
	"LadyMRAs",
	"MensRants",
	"MRActivism",
	"FeMRA",
	"MaleLifestyle",
	"Masculism",
	"NOMAAM",
	"MGTOW",
	"Rights4Men",
	"theredpill",
	"becomeaman",
	"realmasculinity",
	"seduction",
	"Objectivism",
	"new_right",
	"RefutingMarxism"
	
  ]
}
